AccumulationRegisters/ДетализацияПартийТоваровДляНДС2_4.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДетализацияПартийТоваровДляНДС2_4</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезНДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовАктивов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаСписанияНДС</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументИсточник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаОбособленногоУчетаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеРасходовБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНазначенияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетСебестоимостиТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейПартий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНеЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПартий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаДокументаПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДетализацияПартийТоваровДляНДС2_4/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
    |ПОМЕСТИТЬ ДетализацияПартийТоваровДляНДС2_4ПередЗаписью
	|ИЗ
    |	РегистрНакопления.ДетализацияПартийТоваровДляНДС2_4 КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор";
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Партия КАК Партия,
	|	Таблица.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
    |	Таблица.НалоговоеНазначение КАК НалоговоеНазначение,
	|	Таблица.ДокументПоступления КАК ДокументПоступления,
	|	Таблица.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
    |	Таблица.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|	Таблица.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Таблица.КорВидЗапасов КАК КорВидЗапасов,
	|	Таблица.СтатьяРасходовАктивов КАК СтатьяРасходовАктивов,
	|	Таблица.АналитикаРасходов КАК АналитикаРасходов,
	|	Таблица.АналитикаАктивов КАК АналитикаАктивов,
	|	Таблица.ДокументИсточник КАК ДокументИсточник,
	|	Таблица.Знаменатель КАК Знаменатель,
	|	Таблица.СтатьяСписанияНДС КАК СтатьяСписанияНДС,
	|	Таблица.АналитикаСписанияНДС КАК АналитикаСписанияНДС,
	|	Таблица.ТипЗаписи КАК ТипЗаписи,
	|	Таблица.РасчетПартий КАК РасчетПартий,
	|	Таблица.РасчетНеЗавершен КАК РасчетНеЗавершен,
	|	СУММА(Таблица.СтоимостьБезНДС) КАК СтоимостьБезНДСИзменение,
	|	СУММА(Таблица.НДС) КАК НДСИзменение,
	|	СУММА(Таблица.СтоимостьБезНДСУпр) КАК СтоимостьБезНДСУпрИзменение,
	|	СУММА(Таблица.НДСУпр) КАК НДСУпрИзменение
    |ПОМЕСТИТЬ ТаблицаИзмененийДетализацияПартийТоваровДляНДС2_4
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДетализацияПартий.Период КАК Период,
	|		ДетализацияПартий.Регистратор КАК Регистратор,
	|		ДетализацияПартий.Организация КАК Организация,
	|		ДетализацияПартий.Партия КАК Партия,
	|		ДетализацияПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
    |		ДетализацияПартий.НалоговоеНазначение КАК НалоговоеНазначение,
	|		ДетализацияПартий.ДокументПоступления КАК ДокументПоступления,
	|		ДетализацияПартий.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|		ДетализацияПартий.Номенклатура КАК Номенклатура,
	|		ДетализацияПартий.Характеристика КАК Характеристика,
	|		ДетализацияПартий.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ДетализацияПартий.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ДетализацияПартий.НДС КАК НДС,
	|		ДетализацияПартий.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		ДетализацияПартий.НДСУпр КАК НДСУпр,
	|		ДетализацияПартий.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
    |		ДетализацияПартий.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|		ДетализацияПартий.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		ДетализацияПартий.КорВидЗапасов КАК КорВидЗапасов,
	|		ДетализацияПартий.СтатьяРасходовАктивов КАК СтатьяРасходовАктивов,
	|		ДетализацияПартий.АналитикаРасходов КАК АналитикаРасходов,
	|		ДетализацияПартий.АналитикаАктивов КАК АналитикаАктивов,
	|		ДетализацияПартий.ДокументИсточник КАК ДокументИсточник,
	|		ДетализацияПартий.Знаменатель КАК Знаменатель,
	|		ДетализацияПартий.СтатьяСписанияНДС КАК СтатьяСписанияНДС,
	|		ДетализацияПартий.АналитикаСписанияНДС КАК АналитикаСписанияНДС,
	|		ДетализацияПартий.ТипЗаписи КАК ТипЗаписи,
	|		ДетализацияПартий.РасчетПартий КАК РасчетПартий,
	|		ДетализацияПартий.РасчетНеЗавершен КАК РасчетНеЗавершен
	|	ИЗ
    |		ДетализацияПартийТоваровДляНДС2_4ПередЗаписью КАК ДетализацияПартий
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДетализацияПартий.Период КАК Период,
	|		ДетализацияПартий.Регистратор КАК Регистратор,
	|		ДетализацияПартий.Организация КАК Организация,
	|		ДетализацияПартий.Партия КАК Партия,
	|		ДетализацияПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
    |		ДетализацияПартий.НалоговоеНазначение КАК НалоговоеНазначение,
	|		ДетализацияПартий.ДокументПоступления КАК ДокументПоступления,
	|		ДетализацияПартий.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаДокументаПоступления,
	|		ДетализацияПартий.Номенклатура КАК Номенклатура,
	|		ДетализацияПартий.Характеристика КАК Характеристика,
	|		ДетализацияПартий.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		-ДетализацияПартий.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		-ДетализацияПартий.НДС КАК НДС,
	|		-ДетализацияПартий.СтоимостьБезНДСУпр КАК СтоимостьБезНДСУпр,
	|		-ДетализацияПартий.НДСУпр КАК НДСУпр,
	|		ДетализацияПартий.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
    |		ДетализацияПартий.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|		ДетализацияПартий.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		ДетализацияПартий.КорВидЗапасов КАК КорВидЗапасов,
	|		ДетализацияПартий.СтатьяРасходовАктивов КАК СтатьяРасходовАктивов,
	|		ДетализацияПартий.АналитикаРасходов КАК АналитикаРасходов,
	|		ДетализацияПартий.АналитикаАктивов КАК АналитикаАктивов,
	|		ДетализацияПартий.ДокументИсточник КАК ДокументИсточник,
	|		ДетализацияПартий.Знаменатель КАК Знаменатель,
	|		ДетализацияПартий.СтатьяСписанияНДС КАК СтатьяСписанияНДС,
	|		ДетализацияПартий.АналитикаСписанияНДС КАК АналитикаСписанияНДС,
	|		ДетализацияПартий.ТипЗаписи КАК ТипЗаписи,
	|		ДетализацияПартий.РасчетПартий КАК РасчетПартий,
	|		ДетализацияПартий.РасчетНеЗавершен КАК РасчетНеЗавершен
	|	ИЗ
    |		РегистрНакопления.ДетализацияПартийТоваровДляНДС2_4 КАК ДетализацияПартий
	|	ГДЕ
	|		ДетализацияПартий.Регистратор = &Регистратор) КАК Таблица
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.Партия,
	|	Таблица.АналитикаУчетаПартий,
    |	Таблица.НалоговоеНазначение,
	|	Таблица.ДокументПоступления,
	|	Таблица.АналитикаУчетаДокументаПоступления,
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.НаправлениеДеятельности,
	|	Таблица.ХозяйственнаяОперация,
    |	Таблица.КорНалоговоеНазначение,
	|	Таблица.КорАналитикаУчетаНоменклатуры,
	|	Таблица.КорВидЗапасов,
	|	Таблица.СтатьяРасходовАктивов,
	|	Таблица.АналитикаРасходов,
	|	Таблица.АналитикаАктивов,
	|	Таблица.ДокументИсточник,
	|	Таблица.Знаменатель,
	|	Таблица.СтатьяСписанияНДС,
	|	Таблица.АналитикаСписанияНДС,
	|	Таблица.ТипЗаписи,
	|	Таблица.РасчетПартий,
	|	Таблица.РасчетНеЗавершен
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.СтоимостьБезНДС) <> 0
	|	И СУММА(Таблица.НДС) <> 0
	|	И СУММА(Таблица.СтоимостьБезНДСУпр) <> 0
	|	И СУММА(Таблица.НДСУпр) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ДетализацияПартийТоваровДляНДС2_4ПередЗаписью");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
